PHASE 1 PROJECT

**Specifying the Data Analytic Question**

Microsoft have been seeing other companies creating video content and have
decided to create a new movie studio,but they do not know how to create movies.


***problem statement***
You have to understand the movie industry what it is about and what it entails. What kind/types of 
films are currently trending at the box office. You must gather the findings into actionable insights
and visuals, so that the Stakeholders can undertstand what/ the kind of films that their target 
audience like.

DATA UNDERSTANDING


we have been provided with data from different movie sites and files that contain data. From the data that we have been given we see that movies involve alot of people and things that have to be put into consideration. This things are :-
 
 - What kind of movies or genre do people like?

 - Do movies give a good return in terms of profit?

 - What is the production budget for the movie?

 - who are your competitors in the movie industry?

 - when are the release dates of the movie? is it clashing with something else?

 - what kind of marketing was done to promote the movie?

 - what kind of reviews did you get from your audience?

IMPORTING THE LIBRARIES

In [4]:
#Importing libraries

import pandas as pd
import csv
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import sqlite3

CONNECTING TO THE DATABASE

In [5]:
# connecting to database using sqlite3
import sqlite3
conn =sqlite3.connect('im.db')
cur= conn.cursor()

READING THE DATABASE

In [27]:
pd.read_sql("""
            SELECT * 
            FROM sqlite_master 
            WHERE type = 'table' ;
            """, conn)

Empty DataFrame
Columns: [type, name, tbl_name, rootpage, sql]
Index: []

READING THE FILES

In [ ]:
#Reading a csv file
movie_bom = pd.read_csv("bom.movie_gross.csv")
movie_bom

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [ ]:
#Inspecting the data
# Previewing the first 5 rows
movie_bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [ ]:
#Inspecting the data
# Previewing the last 5 rows
movie_bom.tail()

,title,studio,domestic_gross,foreign_gross,year
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [ ]:
#THE NUMBER OF RECORDS IN A DATASET
#The length of rows in the dataframe in movie_bom
length_movie_bom =len(movie_bom)
length_movie_bom

3387

In [ ]:
#CHECKING EACH COLUMN HAS AN APPROPRIATE DATATYPE
#looking for the column and datatypes in movie_bom using .info()
movie_bom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [ ]:
#CLEANING THE DATASET
#looking for duplicates
movie_bom.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
3382    False
3383    False
3384    False
3385    False
3386    False
Length: 3387, dtype: bool

In [ ]:
#CLEANING THE DATASET
#looking for duplicates (false means row has not been duplicated and true means that the row has been duplicated)
movie_bom.duplicated().any()

False

In [ ]:
#Checking for missing data
#True is equivalent to 1 and False is equivalent to 0, taking the .sum() will return the total number of NaN values in the dataset.
#(.isnull().sum() also gives the same answer)
movie_bom.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

READING TITLE RATINGS

In [8]:
#Reading a csv file
title_ratings= pd.read_csv('title.ratings.csv')
title_ratings

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [9]:
#Inspecting the data
# Previewing the first 5 rows
title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [10]:
#Inspecting the data
# Previewing the last 5 rows
title_ratings.tail()

          tconst  averagerating  numvotes
73851  tt9805820            8.1        25
73852  tt9844256            7.5        24
73853  tt9851050            4.7        14
73854  tt9886934            7.0         5
73855  tt9894098            6.3       128

In [12]:
#THE NUMBER OF RECORDS IN A DATASET
#The length of rows in the dataframe in title_ratings
length_title_ratings=len(title_ratings)
length_title_ratings

73856

In [13]:
#CHECKING EACH COLUMN HAS AN APPROPRIATE DATATYPE
#looking for the column and datatypes in title_ratings using .info()
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [14]:
#CLEANING THE DATASET
#looking for duplicates
title_ratings.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
73851    False
73852    False
73853    False
73854    False
73855    False
Length: 73856, dtype: bool

In [15]:
#CLEANING THE DATASET
#looking for duplicates
title_ratings.duplicated()

False

In [16]:
#Checking for missing data
#True is equivalent to 1 and False is equivalent to 0, taking the .sum() will return the total number of NaN values in the dataset.
#(.isnull().sum() also gives the same answer)
title_ratings.isna().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

READING TITLE BASIC

In [17]:
#Reading a csv file
title_basic = pd.read_csv('title.basics.csv')
title_basic

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [18]:
#Inspecting the data
# Previewing the first 5 rows
title_basic.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [19]:
#Inspecting the data
# Previewing the last 5 rows
title_basic.tail()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [20]:
#THE NUMBER OF RECORDS IN A DATASET
#The length of rows in the dataframe in title_basic
length_title_basic=len(title_basic)
length_title_basic

146144

In [21]:
#CHECKING EACH COLUMN HAS AN APPROPRIATE DATATYPE
#looking for the column and datatypes in title_basic using .info()
title_basic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146143 non-null  object
 2   original_title   146122 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [26]:
#CLEANING THE DATASET
#looking for duplicates
title_basic.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
146139    False
146140    False
146141    False
146142    False
146143    False
Length: 146144, dtype: bool

In [25]:
#Checking for missing data
#True is equivalent to 1 and False is equivalent to 0, taking the .sum() will return the total number of NaN values in the dataset.
#(.isnull().sum() also gives the same answer)
title_basic.isna().sum()

tconst                 0
primary_title          1
original_title        22
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64